{
    "homePage": {
        "aboutTitle": "Hey! Meet me...",
        "firstParagraphPart1": "Leonardo Aranguren, a Software Developer, Cloud Engineer, and Technical Lead with a solid foundation in cloud technologies, especially AWS.",
        "firstParagraphPart2": "Hold multiple AWS certifications —Developer Associate, Solutions Architect, Serverless, EKS, Networking Core, and Cloud Quest challenges.",
        "discoveryTitle": "Driven by innovation...",
        "secondParagraphPart1": "He designs, develops, and optimizes robust, scalable cloud solutions.",
        "secondParagraphPart2": "With a strong technical focus, he leads by refining architectures and applying best practices to bring every project to its fullest potential. In every line of code, he seeks innovation, efficiency, and real impact.",
        "experienceTitle": "Experience Highlights",
        "teideCaption": "Teide, Tenerife - Spain"
    },
    "experienceTabs": {
        "cloudEngineer": {
            "label": "☁️ Cloud Engineer",
            "sections": {
                "cicd": {
                    "title": "Cost Optimization and Automation",
                    "icon": "💸",
                    "items": [
                        "Reduced infrastructure costs by over $8,000 USD annually by migrating pipelines from CircleCI to GitHub Actions and optimizing resources in AWS ECS.",
                        "Consolidated 20+ Lambdas into a single repository with Amplify Gen 2, optimizing resource management and reducing operational complexity.",
                        "Built 50+ CI/CD pipelines for deployment, testing, and quality control workflows using GitHub Actions, Jenkins, and CircleCI."
                    ]
                },
                "serverless": {
                    "title": "Serverless Architecture",
                    "icon": "🔐",
                    "items": [
                        "Designed and implemented event-driven serverless solutions with Lambda, Step Functions, SQS, SNS, DynamoDB, EventBridge, S3, and AppSync.",
                        "Implemented infrastructure automation using Terraform, AWS CDK, and Amplify Gen 2 for multi-environment deployments and centralized control.",
                        "Developed secure architecture with VPC, subnets, security groups, and identity management with Cognito to ensure isolation and access control."
                    ]
                }
            }
        },
        "softwareDeveloper": {
            "label": "💻 Software Development",
            "sections": {
                "resilient": {
                    "title": "Refactoring and Modularization",
                    "icon": "🔄",
                    "items": [
                        "Refactored 50+ monolithic APIs into scalable microservices following the single responsibility principle, using Go, Node.js, NestJS, Python, and Laravel.",
                        "Designed decoupled and resilient architectures aligned with the 5 pillars of the AWS Well-Architected Framework.",
                        "Enabled interoperability between microservices and GCP systems through secure and efficient integrations."
                    ]
                },
                "fullstack": {
                    "title": "Cross-Platform Modules and Applications",
                    "icon": "📱",
                    "items": [
                        "Developed ordering and loyalty modules in Next.js, React Native, and React, enhancing user experience in mobile and web apps.",
                        "Designed scalable APIs using GraphQL (AppSync) and REST (API Gateway) for critical customer-facing services.",
                        "Implemented multi-channel authentication with Cognito, event orchestration with SNS, and access control in distributed environments."
                    ]
                }
            }
        },
        "technicalLead": {
            "label": "👨‍💻 Technical Lead",
            "sections": {
                "intelligent": {
                    "title": "Strategic Technical Direction",
                    "icon": "🚀",
                    "items": [
                        "Led the development of the first multi-authenticator system for digital banking channels, integrating security layers in Cognito, SNS, and VPC.",
                        "Designed and coordinated an integration ecosystem between legacy and modern services, enabling a smooth transition to a cloud-native architecture.",
                        "Guided technical teams in designing, planning, and deploying scalable, robust solutions aligned with business objectives."
                    ]
                },
                "leadership": {
                    "title": "Observability and Continuous Improvement",
                    "icon": "📊",
                    "items": [
                        "Implemented custom CloudWatch dashboards, log centralization, and key metrics for health and performance monitoring.",
                        "Achieved complete DevOps cycle automation: Jira integration, testing, deployment, and automatic rollback across multiple environments.",
                        "Promoted continuous quality culture and technical ownership at all levels of development and infrastructure."
                    ]
                }
            }
        }
    }
}
