{
    "homePage": {
        "aboutTitle": "Hey! Know me...",
        "firstParagraphPart1": "Leonardo Aranguren, a Software Developer, Cloud Engineer, and Technical Lead with a solid foundation in cloud technologies, especially AWS.",
        "firstParagraphPart2": "Hold multiple AWS certifications —Developer Associate, Solutions Architect, Serverless, EKS, Networking Core, and Cloud Quest challenges.",
        "discoveryTitle": "Driven by innovation...",
        "secondParagraphPart1": "He designs, develops, and optimizes robust, scalable cloud solutions.",
        "secondParagraphPart2": "With a strong technical focus, he leads by refining architectures and applying best practices to bring every project to its fullest potential. In every line of code, he seeks innovation, efficiency, and real impact.",
        "experienceTitle": "Experience Highlights",
        "teideCaption": "Teide, Tenerife - Spain"
    },
    "experienceTabs": {
        "cloudEngineer": {
            "label": "Cloud Engineer",
            "sections": {
                "cicd": {
                    "title": "Automation of CI/CD Pipelines",
                    "icon": "🔧",
                    "items": [
                        "Designed and implemented CI/CD workflows using GitHub Actions and AWS CodePipeline, reducing deployment time by 60%.",
                        "Built reusable workflows for multi-environment deployments with rollback support."
                    ]
                },
                "serverless": {
                    "title": "Serverless Architecture",
                    "icon": "☁️",
                    "items": [
                        "Developed scalable event-driven systems using AWS Lambda, Step Functions, and EventBridge.",
                        "Created robust observability tooling with custom CloudWatch dashboards and centralized log subscriptions."
                    ]
                }
            }
        },
        "softwareDeveloper": {
            "label": "Software Developer",
            "sections": {
                "resilient": {
                    "title": "Resilient and Secure Systems",
                    "icon": "🛡",
                    "items": [
                        "Led the migration of legacy services to a serverless architecture, increasing uptime and reducing maintenance costs.",
                        "Enforced security best practices through IAM least privilege, API Gateway WAF, and VPC configurations."
                    ]
                },
                "fullstack": {
                    "title": "Full-Stack Development",
                    "icon": "💻",
                    "items": [
                        "Built responsive web applications using React, Next.js, and Material UI.",
                        "Developed backend services with Node.js, Python, and TypeScript."
                    ]
                }
            }
        },
        "technicalLead": {
            "label": "Technical Lead",
            "sections": {
                "intelligent": {
                    "title": "Intelligent Solutions",
                    "icon": "🧠",
                    "items": [
                        "Integrated OpenAI and AWS Bedrock services to build internal AI copilots that boosted productivity in support and dev teams.",
                        "Led architecture decisions for cloud-native applications, focusing on scalability and cost optimization."
                    ]
                },
                "leadership": {
                    "title": "Team Leadership",
                    "icon": "👥",
                    "items": [
                        "Mentored junior developers and conducted technical interviews for new team members.",
                        "Facilitated knowledge sharing sessions and promoted best practices across development teams."
                    ]
                }
            }
        }
    }
}
