{
    "aboutResume": {
        "resume": "Desarrollador Full Stack, Ingeniero Cloud y Líder Técnico"
    },
    "badgesResume": {
        "title": "Insignias",
        "learnMore": "Aprender Más",
        "cloudPractitioner": "Ofrece un conocimiento fundamental de los conceptos, servicios y terminología de la nube de AWS. Este es un buen punto de partida para quienes tienen roles no técnicos y no cuentan con experiencia previa relacionada con la nube o TI, o para quienes tienen experiencia en TI en las instalaciones y buscan dominar los elementos básicos de la nube de AWS.",
        "solutionsArchitect": "Muestra conocimientos y habilidades en tecnología de AWS, en una amplia gama de servicios de AWS. Esta certificación se concentra en el diseño de soluciones optimizadas para el costo y el rendimiento, que demuestra un gran entendimiento del AWS Well-Architected Framework.",
        "developerAssociate": "Muestra el conocimiento y la comprensión de los servicios fundamentales de AWS, sus usos y las prácticas recomendadas de arquitectura básica de AWS, además de competencias de desarrollo, implementación y depuración de aplicaciones basadas en la nube mediante el uso de AWS.",
        "serverless": "Los ganadores de esta insignia han desarrollado habilidades técnicas y conocimientos de los conceptos y servicios serverless de AWS con un enfoque en Lambda, API Gateway, SQS, SNS, Cognito, Kinesis y S3.",
        "networkingCore": "Los ganadores de esta insignia han desarrollado conocimientos técnicos de los conceptos y servicios de redes de AWS con un enfoque en Amazon VPC, AWS Cloud WAN y Amazon Route 53.",
        "eks": "Los ganadores de esta insignia han desarrollado conocimientos sobre la ejecución de microservicios y cargas de trabajo de contenedores con Amazon Elastic Kubernetes Service (Amazon EKS)."
    },
    "homePage": {
        "aboutTitle": "¡Hey! Conóceme…",
        "firstParagraphPart1": "Leonardo Aranguren, Desarrollador de Software, Ingeniero Cloud y Líder Técnico con una sólida base en tecnologías de nube, especialmente en AWS.",
        "firstParagraphPart2": "Cuenta con múltiples certificaciones de AWS —Developer Associate, Solutions Architect, Serverless, Cloud Quests, EKS y Networking Core.",
        "discoveryTitle": "Impulsado por la innovación...",
        "secondParagraphPart1": "Diseña, desarrolla y optimiza soluciones cloud robustas y escalables.",
        "secondParagraphPart2": "Lidera con un enfoque técnico, afinando arquitecturas y aplicando buenas prácticas para llevar cada proyecto a su máximo potencial. En cada línea de código busca innovación, eficiencia y un impacto real.",
        "experienceTitle": "Destacados de Experiencia",
        "teideCaption": "Teide, Tenerife - España"
    },
    "experienceTabs": {
        "cloudEngineer": {
            "label": "☁️ Cloud Engineer",
            "sections": {
                "cicd": {
                    "title": "Optimización de Costos y Automatización",
                    "icon": "💸",
                    "items": [
                        "Redujo costos de infraestructura en más de $8,000 USD anuales al migrar pipelines de CircleCI a GitHub Actions y optimizar recursos en AWS ECS.",
                        "Consolidó 20+ Lambdas en un único repositorio con Amplify Gen 2, optimizando la gestión de recursos y reduciendo complejidad operativa.",
                        "Construyó 50+ pipelines CI/CD para flujos de despliegue, testing y control de calidad usando GitHub Actions, Jenkins y CircleCI."
                    ]
                },
                "serverless": {
                    "title": "Arquitectura Serverless",
                    "icon": "🔐",
                    "items": [
                        "Diseñó e implementó soluciones serverless basadas en eventos con Lambda, Step Functions, SQS, SNS, DynamoDB, EventBridge, S3 y AppSync.",
                        "Implementó automatización de infraestructura usando Terraform, AWS CDK y Amplify Gen 2 para despliegues multi-entorno y control centralizado.",
                        "Desarrolló arquitectura segura con VPC, subnets, security groups, y gestión de identidades con Cognito para garantizar aislamiento y control de acceso."
                    ]
                }
            }
        },
        "softwareDeveloper": {
            "label": "💻 Software Development",
            "sections": {
                "resilient": {
                    "title": "Refactorización y Modularización",
                    "icon": "🔄",
                    "items": [
                        "Refactorizó 50+ APIs monolíticas a microservicios escalables siguiendo el principio de responsabilidad única, usando Go, Node.js, NestJS, Python y Laravel.",
                        "Diseñó arquitecturas desacopladas y resilientes, alineadas con los 5 pilares del AWS Well-Architected Framework.",
                        "Habilitó la interoperabilidad entre microservicios y sistemas GCP mediante integraciones seguras y eficientes."
                    ]
                },
                "fullstack": {
                    "title": "Módulos y Aplicaciones Multiplataforma",
                    "icon": "📱",
                    "items": [
                        "Desarrolló módulos de pedido y fidelización en Next.js, React Native y React, mejorando la experiencia del usuario en apps móviles y web.",
                        "Diseñó APIs escalables usando GraphQL (AppSync) y REST (API Gateway) para servicios críticos orientados a cliente.",
                        "Implementó autenticación multi-canal con Cognito, orquestación de eventos con SNS, y control de acceso en entornos distribuidos."
                    ]
                }
            }
        },
        "technicalLead": {
            "label": "👨‍💻 Lider Técnico",
            "sections": {
                "intelligent": {
                    "title": "Dirección Técnica Estratégica",
                    "icon": "🚀",
                    "items": [
                        "Lideró el desarrollo del primer sistema multi-autenticador para canales bancarios digitales, integrando capas de seguridad en Cognito, SNS y VPC.",
                        "Diseñó y coordinó un ecosistema de integración entre servicios legacy y modernos, habilitando la transición fluida hacia una arquitectura cloud-native.",
                        "Guió equipos técnicos en diseño, planificación y despliegue de soluciones escalables, robustas y alineadas con objetivos de negocio."
                    ]
                },
                "leadership": {
                    "title": "Observabilidad y Mejora Continua",
                    "icon": "📊",
                    "items": [
                        "Implementó dashboards personalizados en CloudWatch, centralización de logs y métricas clave para monitoreo de salud y rendimiento.",
                        "Logró automatización completa del ciclo DevOps: integración con Jira, testing, despliegue y rollback automático en múltiples entornos.",
                        "Promovió cultura de calidad continua y ownership técnico en todos los niveles de desarrollo e infraestructura."
                    ]
                }
            }
        }
    }
}
